sparkfun/Pioneer_IoT_Kit_Shield/Firmware/XBee_WiFi/XBee_WiFi.cydsn/Generated_Source/PSoC6/pdl/devices/psoc6/psoc6ble/common/mdk/startup/startup_psoc6ble_cm4.s
; Reset Handler
Reset_Handler   PROC
                EXPORT  Reset_Handler             [WEAK]
                IMPORT  SystemInit
                IMPORT  Cy_SystemInitFpuEnable
                IMPORT  __main

                ; Define strong function for startup customization
                BL      Cy_OnResetUser

                ; Disable global interrupts
                CPSID I

                ; Copy vectors from ROM to RAM
                LDR r1, =__Vectors
                LDR r0, =__ramVectors
                LDR r2, =__Vectors_Size
Vectors_Copy
                LDR r3, [r1]
                STR r3, [r0]
                ADDS r0, r0, #4
                ADDS r1, r1, #4
                SUBS r2, r2, #1
                CMP r2, #0
                BNE Vectors_Copy

                ; Update Vector Table Offset Register. */
                LDR r0, =__ramVectors
                LDR r1, =0xE000ED08
                STR r0, [r1]
                dsb 0xF

                ; Enable the FPU if used
                LDR     R0, =Cy_SystemInitFpuEnable
                BLX     R0

                LDR     R0, =__main
                BLX     R0

                ; Should never get here
                B       .

                ENDP

; $Sub$$main
|$Sub$$main|    PROC
                EXPORT  |$Sub$$main|
                IMPORT  |$Super$$main|

                LDR     R0, =SystemInit
                BLX     R0

                LDR     R0, =|$Super$$main|
                BX      R0
                ENDP

; Dummy Exception Handlers (infinite loops which can be modified)
NMI_Handler         PROC
                    EXPORT  NMI_Handler               [WEAK]
                    B       .
                    ENDP

Cy_SysLib_FaultHandler PROC
                    EXPORT  Cy_SysLib_FaultHandler   [WEAK]
                    B       .
                    ENDP
HardFault_Wrapper\
                    PROC
                    EXPORT HardFault_Wrapper         [WEAK]
                    movs r0, #4
                    mov r1, LR
                    tst r0, r1
                    beq L_MSP
                    mrs r0, PSP
                    bl L_API_call
L_MSP
                    mrs r0, MSP
L_API_call
                    bl Cy_SysLib_FaultHandler
                    ENDP
HardFault_Handler\
                    PROC
                    EXPORT  HardFault_Handler         [WEAK]
                    B       HardFault_Wrapper
                    ENDP
MemManage_Handler\
                    PROC
                    EXPORT  MemManage_Handler         [WEAK]
                    B       HardFault_Wrapper
                    ENDP
BusFault_Handler\
                    PROC
                    EXPORT  BusFault_Handler          [WEAK]
                    B       HardFault_Wrapper
                    ENDP
UsageFault_Handler\
                    PROC
                    EXPORT  UsageFault_Handler        [WEAK]
                    B       HardFault_Wrapper
                    ENDP
SVC_Handler         PROC
                    EXPORT  SVC_Handler               [WEAK]
                    B       .
                    ENDP
DebugMon_Handler\
                    PROC
                    EXPORT  DebugMon_Handler          [WEAK]
                    B       .
                    ENDP
PendSV_Handler      PROC
                    EXPORT  PendSV_Handler            [WEAK]
                    B       .
                    ENDP
SysTick_Handler     PROC
                    EXPORT  SysTick_Handler           [WEAK]
                    B       .
                    ENDP

Default_Handler     PROC
                    EXPORT      Default_Handler                        [WEAK]
                    EXPORT      ioss_interrupts_gpio_0_IRQHandler      [WEAK]
                    EXPORT      ioss_interrupts_gpio_1_IRQHandler      [WEAK]
                    EXPORT      ioss_interrupts_gpio_2_IRQHandler      [WEAK]
                    EXPORT      ioss_interrupts_gpio_3_IRQHandler      [WEAK]
                    EXPORT      ioss_interrupts_gpio_4_IRQHandler      [WEAK]
                    EXPORT      ioss_interrupts_gpio_5_IRQHandler      [WEAK]
                    EXPORT      ioss_interrupts_gpio_6_IRQHandler      [WEAK]
                    EXPORT      ioss_interrupts_gpio_7_IRQHandler      [WEAK]
                    EXPORT      ioss_interrupts_gpio_8_IRQHandler      [WEAK]
                    EXPORT      ioss_interrupts_gpio_9_IRQHandler      [WEAK]
                    EXPORT      ioss_interrupts_gpio_10_IRQHandler     [WEAK]
                    EXPORT      ioss_interrupts_gpio_11_IRQHandler     [WEAK]
                    EXPORT      ioss_interrupts_gpio_12_IRQHandler     [WEAK]
                    EXPORT      ioss_interrupts_gpio_13_IRQHandler     [WEAK]
                    EXPORT      ioss_interrupts_gpio_14_IRQHandler     [WEAK]
                    EXPORT      ioss_interrupt_gpio_IRQHandler         [WEAK]
                    EXPORT      ioss_interrupt_vdd_IRQHandler          [WEAK]
                    EXPORT      lpcomp_interrupt_IRQHandler            [WEAK]
                    EXPORT      scb_8_interrupt_IRQHandler             [WEAK]
                    EXPORT      srss_interrupt_mcwdt_0_IRQHandler      [WEAK]
                    EXPORT      srss_interrupt_mcwdt_1_IRQHandler      [WEAK]
                    EXPORT      srss_interrupt_backup_IRQHandler       [WEAK]
                    EXPORT      srss_interrupt_IRQHandler              [WEAK]
                    EXPORT      pass_interrupt_ctbs_IRQHandler         [WEAK]
                    EXPORT      bless_interrupt_IRQHandler             [WEAK]
                    EXPORT      cpuss_interrupts_ipc_0_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_ipc_1_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_ipc_2_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_ipc_3_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_ipc_4_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_ipc_5_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_ipc_6_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_ipc_7_IRQHandler      [WEAK]
                    EXPORT      scb_0_interrupt_IRQHandler             [WEAK]
                    EXPORT      scb_1_interrupt_IRQHandler             [WEAK]
                    EXPORT      scb_2_interrupt_IRQHandler             [WEAK]
                    EXPORT      scb_3_interrupt_IRQHandler             [WEAK]
                    EXPORT      scb_4_interrupt_IRQHandler             [WEAK]
                    EXPORT      scb_5_interrupt_IRQHandler             [WEAK]
                    EXPORT      scb_6_interrupt_IRQHandler             [WEAK]
                    EXPORT      scb_7_interrupt_IRQHandler             [WEAK]
                    EXPORT      csd_interrupt_IRQHandler               [WEAK]
                    EXPORT      cpuss_interrupts_dw0_0_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_dw0_1_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_dw0_2_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_dw0_3_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_dw0_4_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_dw0_5_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_dw0_6_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_dw0_7_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_dw0_8_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_dw0_9_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_dw0_10_IRQHandler     [WEAK]
                    EXPORT      cpuss_interrupts_dw0_11_IRQHandler     [WEAK]
                    EXPORT      cpuss_interrupts_dw0_12_IRQHandler     [WEAK]
                    EXPORT      cpuss_interrupts_dw0_13_IRQHandler     [WEAK]
                    EXPORT      cpuss_interrupts_dw0_14_IRQHandler     [WEAK]
                    EXPORT      cpuss_interrupts_dw0_15_IRQHandler     [WEAK]
                    EXPORT      cpuss_interrupts_dw1_0_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_dw1_1_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_dw1_2_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_dw1_3_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_dw1_4_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_dw1_5_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_dw1_6_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_dw1_7_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_dw1_8_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_dw1_9_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupts_dw1_10_IRQHandler     [WEAK]
                    EXPORT      cpuss_interrupts_dw1_11_IRQHandler     [WEAK]
                    EXPORT      cpuss_interrupts_dw1_12_IRQHandler     [WEAK]
                    EXPORT      cpuss_interrupts_dw1_13_IRQHandler     [WEAK]
                    EXPORT      cpuss_interrupts_dw1_14_IRQHandler     [WEAK]
                    EXPORT      cpuss_interrupts_dw1_15_IRQHandler     [WEAK]
                    EXPORT      cpuss_interrupts_fault_0_IRQHandler    [WEAK]
                    EXPORT      cpuss_interrupts_fault_1_IRQHandler    [WEAK]
                    EXPORT      cpuss_interrupt_crypto_IRQHandler      [WEAK]
                    EXPORT      cpuss_interrupt_fm_IRQHandler          [WEAK]
                    EXPORT      cpuss_interrupts_cm0_cti_0_IRQHandler  [WEAK]
                    EXPORT      cpuss_interrupts_cm0_cti_1_IRQHandler  [WEAK]
                    EXPORT      cpuss_interrupts_cm4_cti_0_IRQHandler  [WEAK]
                    EXPORT      cpuss_interrupts_cm4_cti_1_IRQHandler  [WEAK]
                    EXPORT      tcpwm_0_interrupts_0_IRQHandler        [WEAK]
                    EXPORT      tcpwm_0_interrupts_1_IRQHandler        [WEAK]
                    EXPORT      tcpwm_0_interrupts_2_IRQHandler        [WEAK]
                    EXPORT      tcpwm_0_interrupts_3_IRQHandler        [WEAK]
                    EXPORT      tcpwm_0_interrupts_4_IRQHandler        [WEAK]
                    EXPORT      tcpwm_0_interrupts_5_IRQHandler        [WEAK]
                    EXPORT      tcpwm_0_interrupts_6_IRQHandler        [WEAK]
                    EXPORT      tcpwm_0_interrupts_7_IRQHandler        [WEAK]
                    EXPORT      tcpwm_1_interrupts_0_IRQHandler        [WEAK]
                    EXPORT      tcpwm_1_interrupts_1_IRQHandler        [WEAK]
                    EXPORT      tcpwm_1_interrupts_2_IRQHandler        [WEAK]
                    EXPORT      tcpwm_1_interrupts_3_IRQHandler        [WEAK]
                    EXPORT      tcpwm_1_interrupts_4_IRQHandler        [WEAK]
                    EXPORT      tcpwm_1_interrupts_5_IRQHandler        [WEAK]
                    EXPORT      tcpwm_1_interrupts_6_IRQHandler        [WEAK]
                    EXPORT      tcpwm_1_interrupts_7_IRQHandler        [WEAK]
                    EXPORT      tcpwm_1_interrupts_8_IRQHandler        [WEAK]
                    EXPORT      tcpwm_1_interrupts_9_IRQHandler        [WEAK]
                    EXPORT      tcpwm_1_interrupts_10_IRQHandler       [WEAK]
                    EXPORT      tcpwm_1_interrupts_11_IRQHandler       [WEAK]
                    EXPORT      tcpwm_1_interrupts_12_IRQHandler       [WEAK]
                    EXPORT      tcpwm_1_interrupts_13_IRQHandler       [WEAK]
                    EXPORT      tcpwm_1_interrupts_14_IRQHandler       [WEAK]
                    EXPORT      tcpwm_1_interrupts_15_IRQHandler       [WEAK]
                    EXPORT      tcpwm_1_interrupts_16_IRQHandler       [WEAK]
                    EXPORT      tcpwm_1_interrupts_17_IRQHandler       [WEAK]
                    EXPORT      tcpwm_1_interrupts_18_IRQHandler       [WEAK]
                    EXPORT      tcpwm_1_interrupts_19_IRQHandler       [WEAK]
                    EXPORT      tcpwm_1_interrupts_20_IRQHandler       [WEAK]
                    EXPORT      tcpwm_1_interrupts_21_IRQHandler       [WEAK]
                    EXPORT      tcpwm_1_interrupts_22_IRQHandler       [WEAK]
                    EXPORT      tcpwm_1_interrupts_23_IRQHandler       [WEAK]
                    EXPORT      udb_interrupts_0_IRQHandler            [WEAK]
                    EXPORT      udb_interrupts_1_IRQHandler            [WEAK]
                    EXPORT      udb_interrupts_2_IRQHandler            [WEAK]
                    EXPORT      udb_interrupts_3_IRQHandler            [WEAK]
                    EXPORT      udb_interrupts_4_IRQHandler            [WEAK]
                    EXPORT      udb_interrupts_5_IRQHandler            [WEAK]
                    EXPORT      udb_interrupts_6_IRQHandler            [WEAK]
                    EXPORT      udb_interrupts_7_IRQHandler            [WEAK]
                    EXPORT      udb_interrupts_8_IRQHandler            [WEAK]
                    EXPORT      udb_interrupts_9_IRQHandler            [WEAK]
                    EXPORT      udb_interrupts_10_IRQHandler           [WEAK]
                    EXPORT      udb_interrupts_11_IRQHandler           [WEAK]
                    EXPORT      udb_interrupts_12_IRQHandler           [WEAK]
                    EXPORT      udb_interrupts_13_IRQHandler           [WEAK]
                    EXPORT      udb_interrupts_14_IRQHandler           [WEAK]
                    EXPORT      udb_interrupts_15_IRQHandler           [WEAK]
                    EXPORT      pass_interrupt_sar_IRQHandler          [WEAK]
                    EXPORT      audioss_interrupt_i2s_IRQHandler       [WEAK]
                    EXPORT      audioss_interrupt_pdm_IRQHandler       [WEAK]
                    EXPORT      profile_interrupt_IRQHandler           [WEAK]
                    EXPORT      smif_interrupt_IRQHandler              [WEAK]
                    EXPORT      usb_interrupt_hi_IRQHandler            [WEAK]
                    EXPORT      usb_interrupt_med_IRQHandler           [WEAK]
                    EXPORT      usb_interrupt_lo_IRQHandler            [WEAK]
                    EXPORT      pass_interrupt_dacs_IRQHandler         [WEAK]

